name: "first"
platform: "tensorrt_plan"
max_batch_size: 1
input {
  name: "data"
  data_type: TYPE_FP32
  format: FORMAT_NCHW
  dims: 1
  dims: 28
  dims: 28
}
output {
  name: "prob"
  data_type: TYPE_FP32
  dims: 10
  dims: 1
  dims: 1
}
instance_group {
  gpus: 0
  kind: KIND_GPU
}
