name: "resnet_v1_50"
platform: "openvino"
platform_version: "1.5.12.49d067a0"
max_batch_size: 5
input {
  name: "input"
  data_type: DT_FLOAT
  format: FORMAT_NCHW
  dims: 3
  dims: 224
  dims: 224
}
output {
  name: "resnet_v1_50/predictions/Reshape_1"
  data_type: DT_FLOAT
  dims: 1000
}

dynamic_batching {
  preferred_batch_size: 5
  max_queue_delay_microseconds: 10
}
